//Написати цикли, які роблять наступне:
//
// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).


// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// for (let i = 20; i <= 30; i++){
//     console.log(i)
//     if (i !== 30){
//         console.log(i + 0.5)
//     }
// }


// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// for (let i = 10; i <= 100; i += 10){
//     console.log(i+" доларів це "+i*27+" гривень.")
// }


// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// let N = +prompt("Введи число N")
// for (let i = 1; i <= 100; i++){
//     if (i * i <= N){
//
//         console.log(i)
//     }
// }

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// const num = +prompt("Введіть ціле число:");
//
// if (num <= 1) {
//     console.log(`${num} не є простим числом.`);
// } else {
//     let simple = true;
//     for (let i = 2; i < num; i++) {
//         if (num % i === 0) {
//             simple = false;
//             break;
//         }
//     }
//     if (simple) {
//         console.log(`${num} є простим числом.`);
//     } else {
//         console.log(`${num} не є простим числом.`);
//     }
// }

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
// let num = +prompt("Число")
// let result = false
// for (let i = 1; i < num; i++){
//    if (Math.pow(3, i) === num){
//        result = true
//        break
//    }
// }
// if (result){
//     console.log("Число "+num+" можна одержати шляхом зведення числа 3 у деякий ступінь.")
// }
// else{
//     console.log("Число "+num+" НЕ можна одержати шляхом зведення числа 3 у деякий ступінь.")
// }

