// В якості ДЗ, необхідно вирішити дві наступні задачі:
//
// Отримати від користувача 3 рядки та вивести їх у довільному порядку однією командою (конкатенація);
// Розбити за цифрами п'ятизначне число і вивести у вихідному порядку через пробіл.

// Отримати від користувача 3 рядки та вивести їх у довільному порядку однією командою (конкатенація);
let a = prompt("Введи перший рядок")
let b = prompt("Введи другий рядок")
let c = prompt("Введи третій рядок")
alert("Ваше речення: "+a +" "+b+ " "+c)

// Розбити за цифрами п'ятизначне число і вивести у вихідному порядку через пробіл.
let number = prompt("Введіть число")
const result = number.split('').join(' ');
console.log(result);